#ifndef __FUNC_H__
#define __FUNC_H__

#include <stdio.h>
#include <unistd.h>
#include <stdbool.h>


/*************************************************************************
 * @brief  打印数字的二进制形式
 * @date   2023-01-11 10:39
 **************************************************************************/
void print_bin(int num);

/*************************************************************************
 * @brief  文件是否存在
 * @date   2023-02-06 08:29
 * @author xiaole
 * @param  file_path 文件路径
 **************************************************************************/
bool is_file_exists(char *file_path);

#endif /* __FUNC_H__ */